# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\barto\Dropbox\PSoC\Grbl_USB_Native\Grbl_USB_Native.cydsn\Grbl_USB_Native.cyprj
# Date: Sun, 15 Jul 2018 17:58:52 GMT
#set_units -time ns
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 15.625 -waveform {0 7.8125} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 15.625 -waveform {0 7.8125} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 65 129} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {Clock_Step_Pulse} -source [get_pins {ClockBlock/clk_sync}] -edges {1 257 513} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_clock -name {CyScBoostClk} -period 93.75 -waveform {0 46.875} [list [get_pins {ClockBlock/aclk_glb_0}]]
create_generated_clock -name {Clock_Lim_DB} -source [get_pins {ClockBlock/clk_sync}] -edges {1 174763 349525} -nominal_period 2730666.6666666665 [list [get_pins {ClockBlock/dclk_glb_2}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\Users\barto\Dropbox\PSoC\Grbl_USB_Native\Grbl_USB_Native.cydsn\TopDesign\PSoC5\TopDesign.cysch
# Project: C:\Users\barto\Dropbox\PSoC\Grbl_USB_Native\Grbl_USB_Native.cydsn\Grbl_USB_Native.cyprj
# Date: Sun, 15 Jul 2018 17:58:46 GMT
